"""Модуль `appointments/apps.py` застосунку `appointments`.

Містить код проєкту Avelon Healthcare та відповідає за частину бізнес-логіки, налаштувань, форм, моделей, представлень або допоміжних сервісів.
Документація в модулі додана українською мовою для полегшення підтримки, читання коду та генерації технічної документації.
"""

from django.apps import AppConfig


class AppointmentsConfig(AppConfig):
    """Клас `AppointmentsConfig` інкапсулює повʼязану логіку проєкту.

    Базові класи: `AppConfig`.
    Використовується для опису доменної сутності, форми, адміністративної конфігурації, сервісу або представлення залежно від місця використання.
    """
    name = 'appointments'
